app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2016-07-08 20:38:45.465884"], ["updated_at", "2016-07-08 20:38:45.465884"]]
---
  def create
    @post = Post.create(:title => params[:title], :description => params[:descriptionr])